JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_sysctrl.h
/**
 * @file cw32l012_sysctrl.h
 * @author WHXY
 * @brief
 * @version 0.1
 * @date 2024-08-07
 *
 * @copyright Copyright (c) 2022
 *
 */
/*******************************************************************************
*
* 代码许可和免责信息
* 武汉芯源半导体有限公司授予您使用所有编程代码示例的非专属的版权许可，您可以由此
* 生成根据您的特定需要而定制的相似功能。根据不能被排除的任何法定保证，武汉芯源半
* 导体有限公司及其程序开发商和供应商对程序或技术支持（如果有）不提供任何明示或暗
* 含的保证或条件，包括但不限于暗含的有关适销性、适用于某种特定用途和非侵权的保证
* 或条件。
* 无论何种情形，武汉芯源半导体有限公司及其程序开发商或供应商均不对下列各项负责，
* 即使被告知其发生的可能性时，也是如此：数据的丢失或损坏；直接的、特别的、附带的
* 或间接的损害，或任何后果性经济损害；或利润、业务、收入、商誉或预期可节省金额的
* 损失。
* 某些司法辖区不允许对直接的、附带的或后果性的损害有任何的排除或限制，因此某些或
* 全部上述排除或限制可能并不适用于您。
*
*******************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CW32L012_SYSCTRL_H
#define __CW32L012_SYSCTRL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "system_cw32l012.h"
#include "cw32l012_gpio.h"

typedef struct {   
    uint32_t SourceFreq;
    uint32_t PLL_OutFreq;    
    uint16_t ClockSource;
    uint16_t WaitCycle;
}PLL_InitTypeDef;
//==================================================================================
#define HSIOSC_VALUE                               ((uint32_t)96000000)                 /*!< Value of the Internal oscillator in Hz*/
#define HSE_VALUE                                  ((uint32_t)16000000)                 /*!< Value of the External oscillator in Hz */

#define LSI_VALUE                                  ((uint32_t)32800)                    /*!< Value of the External oscillator in Hz */
#define LSE_VALUE                                  ((uint32_t)32768)                    /*!< Value of the External oscillator in Hz */

#define LSE_PIN_PORT                               CW_GPIOC
#define LSE_PIN_IN                                 GPIO_PIN_14
#define LSE_PIN_OUT                                GPIO_PIN_15

#define HSE_PIN_PORT                               CW_GPIOF
#define HSE_PIN_IN                                 GPIO_PIN_0
#define HSE_PIN_OUT                                GPIO_PIN_1

#define PCLK_OUT_PIN_PORT                          CW_GPIOA
#define PCLK_OUT_PIN                               GPIO_PIN_3
#define PCLK_OUT_PIN_AF                            4

#define MCO_PIN_PORT                               CW_GPIOA
#define MCO_PIN                                    GPIO_PIN_4
#define MCO_PIN_AF                                 4
/* SYSCTRL CR0 --------------------------------------------------------*/
#define SYSCTRL_KEY                                (0x5A5A0000U)
#define SYSCTRL_KEY_MASK                           (0xFFFF0000U)
#define SYSCTRL_KEY_MASK_INV                       (0x0000FFFFU)

#define SYSCTRL_HCLK_DIV1                          (0x0UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK not divided */
#define SYSCTRL_HCLK_DIV2                          (0x1UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 2 */
#define SYSCTRL_HCLK_DIV4                          (0x2UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 4 */
#define SYSCTRL_HCLK_DIV8                          (0x3UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 8 */
#define SYSCTRL_HCLK_DIV16                         (0x4UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 16 */
#define SYSCTRL_HCLK_DIV32                         (0x5UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 32 */
#define SYSCTRL_HCLK_DIV64                         (0x6UL << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 64 */
#define SYSCTRL_HCLK_DIV128                        (0x7ul << SYSCTRL_CR0_HCLKPRS_Pos)   /*!< SYSCLK divided by 128 */
#define IS_SYSCTRL_HCLKPRS(INSTANCE)               (((INSTANCE) == SYSCTRL_HCLK_DIV1)              ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV2)               ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV4)               ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV8)               ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV16)              ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV32)              ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV64)              ||\
                                                   ((INSTANCE) == SYSCTRL_HCLK_DIV128))

#define SYSCTRL_PCLK_DIV1                          (0x0UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK not divided */
#define SYSCTRL_PCLK_DIV2                          (0x1UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 2 */
#define SYSCTRL_PCLK_DIV4                          (0x2UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 4 */
#define SYSCTRL_PCLK_DIV8                          (0x3UL << SYSCTRL_CR0_PCLKPRS_Pos)   /*!< HCLK divided by 8 */
#define IS_SYSCTRL_PCLKPRS(INSTANCE)               (((INSTANCE) == SYSCTRL_PCLK_DIV1)              ||\
                                                   ((INSTANCE) == SYSCTRL_PCLK_DIV2)               ||\
                                                   ((INSTANCE) == SYSCTRL_PCLK_DIV4)               ||\
                                                   ((INSTANCE) == SYSCTRL_PCLK_DIV8))

#define SYSCTRL_SYSCLKSRC_HSI                      (0x00000000U)                        /*!< HSI selected as system clock */
#define SYSCTRL_SYSCLKSRC_HSE                      (0x00000001U)                        /*!< HSE selected as system clock */
#define SYSCTRL_SYSCLKSRC_PLL                      (0x00000002U)                        /*!< LSI selected as system clock */
#define SYSCTRL_SYSCLKSRC_LSI                      (0x00000003U)                        /*!< LSI selected as system clock */
#define SYSCTRL_SYSCLKSRC_LSE                      (0x00000004U)                        /*!< LSE selected as system clock */
 
#define IS_SYSCTRL_SYSCLKSRC(INSTANCE)             (((INSTANCE) == SYSCTRL_SYSCLKSRC_HSI)          ||\
                                                   ((INSTANCE) == SYSCTRL_SYSCLKSRC_HSE)           ||\
                                                   ((INSTANCE) == SYSCTRL_SYSCLKSRC_LSI)           ||\
                                                   ((INSTANCE) == SYSCTRL_SYSCLKSRC_LSE))

/* SYSCTRL CR1 --------------------------------------------------------*/
#define SYSCTRL_HSIEN                              bv0
#define SYSCTRL_HSEEN                              bv1
#define SYSCTRL_PLLEN                              bv2
#define SYSCTRL_LSIEN                              bv3
#define SYSCTRL_LSEEN                              bv4
#define SYSCTRL_LSELOCKEN                          bv5
#define SYSCTRL_LSELOCKDIS                         0x00UL
#define IS_SYSCTRL_LSELOCK_STATUS(INSTANCE)        (((INSTANCE) == SYSCTRL_LSELOCKEN)          ||\
                                                   ((INSTANCE) == SYSCTRL_LSELOCKDIS))

