JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_sysctrl.h
#define SYSCTRL_LSECCSEN                            bv6
#define SYSCTRL_HSECCSEN                            bv7
#define SYSCTRL_CLKCCSEN                            bv8
#define IS_SYSCTRL_CCS_STATUS(INSTANCE)            (((INSTANCE) == SYSCTRL_LSECCSEN)           ||\
                                                   ((INSTANCE) == SYSCTRL_HSECCSEN)            ||\
                                                   ((INSTANCE) == SYSCTRL_CLKCCSEN))

/* SYSCTRL CR2 --------------------------------------------------------*/
#define SYSCTRL_RAMBRKEN                        bv15
#define SYSCTRL_LVDBRKEN                        bv14
#define SYSCTRL_DSBRKEN                         bv13
#define SYSCTRL_LOCKUPBRKEN                     bv12
#define SYSCTRL_LSEBRKEN                        bv11
#define SYSCTRL_HSEBRKEN                        bv10
//#define SYSCTRL_RTC_LOWPOWEREN                  bv7
#define SYSCTRL_FLASHWAIT_24M                   (0x00UL)
#define SYSCTRL_FLASHWAIT_48M                   (0x01UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define SYSCTRL_FLASHWAIT_72M                   (0x02UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define SYSCTRL_FLASHWAIT_96M                   (0x03UL << SYSCTRL_CR2_FLASHWAIT_Pos)
#define IS_SYSCTRL_FLASHWAIT_VALUE(VAL)         (((VAL) == SYSCTRL_FLASHWAIT_24M) ||\
                                                 ((VAL) == SYSCTRL_FLASHWAIT_48M) ||\
                                                 ((VAL) == SYSCTRL_FLASHWAIT_72M) ||\
                                                 ((VAL) == SYSCTRL_FLASHWAIT_96M))

#define SYSCTRL_WAKEUPCLKEN                    bv3
#define SYSCTRL_WAKEUPCLKDIS                   0x00UL
#define IS_SYSCTRL_WAKEUPCLK_STATUS(INSTANCE)  (((INSTANCE) == SYSCTRL_WAKEUPCLKEN)          ||\
                                                ((INSTANCE) == SYSCTRL_WAKEUPCLKDIS))

#define SYSCTRL_LOCKUPEN                       bv2
#define SYSCTRL_LOCKUPDIS                      0x00UL
#define IS_SYSCTRL_LOCKUP_STATUS(INSTANCE)     (((INSTANCE) == SYSCTRL_LOCKUPEN)          ||\
                                               ((INSTANCE) == SYSCTRL_LOCKUPDIS))

#define SYSCTRL_SWDIOEN                        0x00UL
#define SYSCTRL_SWDIODIS                       bv1
#define IS_SYSCTRL_SWDIO_STATUS(INSTANCE)      (((INSTANCE) == SYSCTRL_SWDIOEN)          ||\
                                               ((INSTANCE) == SYSCTRL_SWDIODIS))
                                               
//#define SYSCTRL_RSTIOEN                        0x00UL
//#define SYSCTRL_RSTIODIS                       bv0

/* SYSCTRL HSI --------------------------------------------------------*/
#define SYSCTRL_HSI_TRIMCODEADDR                       (0x001007C0U)   //


#define SYSCTRL_HSIOSC_DIV1                            ((uint32_t)(1UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV2                            ((uint32_t)(2UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV3                            ((uint32_t)(3UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV4                            ((uint32_t)(4UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV5                            ((uint32_t)(5UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV6                            ((uint32_t)(6UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV7                            ((uint32_t)(7UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV8                            ((uint32_t)(8UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV9                            ((uint32_t)(9UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV10                           ((uint32_t)(10UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV12                           ((uint32_t)(11UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV16                           ((uint32_t)(12UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV20                           ((uint32_t)(13UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV24                           ((uint32_t)(14UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV28                           ((uint32_t)(15UL << SYSCTRL_HSI_DIV_Pos))
#define SYSCTRL_HSIOSC_DIV32                           ((uint32_t)(0UL))
#define HSIOSC_TO_HSI96MHZ                             SYSCTRL_HSIOSC_DIV1
#define HSIOSC_TO_HSI48MHZ                             SYSCTRL_HSIOSC_DIV2
#define HSIOSC_TO_HSI32MHZ                             SYSCTRL_HSIOSC_DIV3
#define HSIOSC_TO_HSI24MHZ                             SYSCTRL_HSIOSC_DIV4
#define HSIOSC_TO_HSI19P2MHZ                           SYSCTRL_HSIOSC_DIV5
#define HSIOSC_TO_HSI16MHZ                             SYSCTRL_HSIOSC_DIV6
#define HSIOSC_TO_HSI13P7MHZ                           SYSCTRL_HSIOSC_DIV7
#define HSIOSC_TO_HSI12MHZ                             SYSCTRL_HSIOSC_DIV8
#define HSIOSC_TO_HSI10P6MHZ                           SYSCTRL_HSIOSC_DIV9
#define HSIOSC_TO_HSI9P6MHZ                            SYSCTRL_HSIOSC_DIV10
#define HSIOSC_TO_HSI8MHZ                              SYSCTRL_HSIOSC_DIV12
#define HSIOSC_TO_HSI6MHZ                              SYSCTRL_HSIOSC_DIV16
#define HSIOSC_TO_HSI4P8MHZ                            SYSCTRL_HSIOSC_DIV20
#define HSIOSC_TO_HSI4MHZ                              SYSCTRL_HSIOSC_DIV24
#define HSIOSC_TO_HSI3P4MHZ                            SYSCTRL_HSIOSC_DIV28
#define HSIOSC_TO_HSI3MHZ                              SYSCTRL_HSIOSC_DIV32

#define IS_SYSCTRL_HSIOSC_DIV(INSTANCE)                (((INSTANCE) == SYSCTRL_HSIOSC_DIV1)         ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV2)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV3)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV4)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV5)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV6)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV7)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV8)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV9)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV10)         ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV12)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV16)         ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV20)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV24)         ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV28)          ||\
                                                        ((INSTANCE) == SYSCTRL_HSIOSC_DIV32))

/* SYSCTRL LSI --------------------------------------------------------*/
#define SYSCTRL_LSI_TRIMCODEADDR                       (0x001007C2U)     //

#define SYSCTRL_LSI_WAITCYCLE_6                        ((uint32_t)(0x0UL << SYSCTRL_LSI_WAITCYCLE_Pos))
#define SYSCTRL_LSI_WAITCYCLE_18                       ((uint32_t)(0x1UL << SYSCTRL_LSI_W13ITCYCLE_Pos))
#define SYSCTRL_LSI_WAITCYCLE_66                       ((uint32_t)(0x2UL << SYSCTRL_LSI_WAITCYCLE_Pos))
#define SYSCTRL_LSI_WAITCYCLE_258                      ((uint32_t)(0x3UL << SYSCTRL_LSI_WAITCYCLE_Pos))


/* SYSCTRL HSE --------------------------------------------------------*/
#define SYSCTRL_HSE_FLT_CLOSE                         (0U)
#define SYSCTRL_HSE_FLT_OPEN                          (1U << SYSCTRL_HSE_DIGFLT_Pos)

#define SYSCTRL_HSE_PDRIVER_LEVEL0                       ((uint32_t)(0x0UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL1                       ((uint32_t)(0x1UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL2                       ((uint32_t)(0x2UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL3                       ((uint32_t)(0x3UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL4                       ((uint32_t)(0x4UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL5                       ((uint32_t)(0x5UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL6                       ((uint32_t)(0x6UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL7                       ((uint32_t)(0x7UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL8                       ((uint32_t)(0x8UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL9                       ((uint32_t)(0x9UL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL10                      ((uint32_t)(0xAUL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL11                      ((uint32_t)(0xBUL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL12                      ((uint32_t)(0xCUL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL13                      ((uint32_t)(0xDUL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL14                      ((uint32_t)(0xEUL << SYSCTRL_HSE_PDRIVER_Pos))
#define SYSCTRL_HSE_PDRIVER_LEVEL15                      ((uint32_t)(0xFUL << SYSCTRL_HSE_PDRIVER_Pos))


#define SYSCTRL_HSE_DETCNT_4M                            ((uint32_t)(2000UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_8M                            ((uint32_t)(1000UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_12M                           ((uint32_t)(666UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_16M                           ((uint32_t)(500UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_24M                           ((uint32_t)(333UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_32M                           ((uint32_t)(250UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_48M                           ((uint32_t)(167UL << SYSCTRL_HSE_DETCNT_Pos))
#define SYSCTRL_HSE_DETCNT_(X)M                          ((uint32_t)(8000/X) << SYSCTRL_HSE_DETCNT_Pos)

#define SYSCTRL_HEX_ENPOL_HIGH                           (0x00000000U)
#define SYSCTRL_HEX_ENPOL_LOW                            (bv7)

#define SYSCTRL_HSE_MODE_OSC                             (0x00000000U)
#define SYSCTRL_HSE_MODE_CLK                        bv6
#define IS_SYSCTRL_HSE_MODE(INSTANCE)               (((INSTANCE) == SYSCTRL_HSE_MODE_OSC) ||\
                                                     ((INSTANCE) == SYSCTRL_HSE_MODE_CLK))


