JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_sysctrl.h
#define IS_SYSCTRL_LSE_DRIVER(DRIVER)                  ((DRIVER) < 0x10)

/* SYSCTRL PLL  --------------------------------------------------------*/
#define SYSCTRL_PLL_WAIT_CYCLE_128                      (0U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_256                      (1U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_512                      (2U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_1024                     (3U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_2048                     (4U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_4096                     (5U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_8192                     (6U << SYSCTRL_PLL_WAITCYCLE_Pos)
#define SYSCTRL_PLL_WAIT_CYCLE_16384                    (7U << SYSCTRL_PLL_WAITCYCLE_Pos)

#define SYSCTRL_PLL_DIV1                                 (0U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV2                                 (1U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV3                                 (2U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV4                                 (3U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV5                                 (4U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV6                                 (5U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV7                                 (6U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV8                                 (7U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV9                                 (8U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV10                                (9U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV11                                (10U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV12                                (11U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV13                                (12U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV14                                (13U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV15                                (14U << SYSCTRL_PLL_DIV_Pos)
#define SYSCTRL_PLL_DIV16                                (15U << SYSCTRL_PLL_DIV_Pos)

#define SYSCTRL_PLL_SOURCE_HSI_48M                       (0U << SYSCTRL_PLL_SOURCE_Pos)
#define SYSCTRL_PLL_SOURCE_HSE                           (1U << SYSCTRL_PLL_SOURCE_Pos)

/* SYSCTRL ISR  --------------------------------------------------------*/
#define SYSCTRL_FLAG_LSESTABLE                         bv15
#define SYSCTRL_FLAG_LSISTABLE                         bv14
#define SYSCTRL_FLAG_PLLSTABLE                         bv13
#define SYSCTRL_FLAG_HSESTABLE                         bv12
#define SYSCTRL_FLAG_HSISTABLE                         bv11
#define IS_SYSCTRL_STABLEFLAG(FLAG)                    ((FLAG) == SYSCTRL_FLAG_HSISTABLE || \
                                                        (FLAG) == SYSCTRL_FLAG_HSESTABLE || \
                                                        (FLAG) == SYSCTRL_FLAG_LSESTABLE || \
                                                        (FLAG) == SYSCTRL_FLAG_LSISTABLE || \
                                                        (FLAG) == SYSCTRL_FLAG_PLLSTABLE)

#define SYSCTRL_FLAG_HSEFAULT                          bv8
#define SYSCTRL_FLAG_LSEFAULT                          bv7
#define SYSCTRL_FLAG_HSEFAIL                           bv6
#define SYSCTRL_FLAG_LSEFAIL                           bv5
#define SYSCTRL_FLAG_LSERDY                            bv4
#define SYSCTRL_FLAG_LSIRDY                            bv3
#define SYSCTRL_FLAG_PLLRDY                            bv2
#define SYSCTRL_FLAG_HSERDY                            bv1
#define SYSCTRL_FLAG_HSIRDY                            bv0

/* SYSCTRL IER ICR  --------------------------------------------------------*/
#define SYSCTRL_IT_HSEFAULT                            (bv8)
#define SYSCTRL_IT_LSEFAULT                            (bv7)
#define SYSCTRL_IT_HSEFAIL                             (bv6)
#define SYSCTRL_IT_LSEFAIL                             (bv5)
#define SYSCTRL_IT_LSERDY                              (bv4)
#define SYSCTRL_IT_LSIRDY                              (bv3)
#define SYSCTRL_IT_PLLRDY                              (bv2)
#define SYSCTRL_IT_HSERDY                              (bv1)
#define SYSCTRL_IT_HSIRDY                              (bv0)
#define IS_SYSCTRL_IT(IT)                              ((((IT) & 0xFFFFFFE0) == 0x0UL) && ((IT) != 0x0UL))
#define IS_SYSCTRL_GET_IT(IT)                          (((IT) == SYSCTRL_IT_HSEFAULT) || \
                                                        ((IT) == SYSCTRL_IT_LSEFAULT) || \
                                                        ((IT) == SYSCTRL_IT_HSEFAIL) || \
                                                        ((IT) == SYSCTRL_IT_LSEFAIL) || \
                                                        ((IT) == SYSCTRL_IT_LSERDY) ||\
                                                        ((IT) == SYSCTRL_IT_LSIRDY) ||\
                                                        ((IT) == SYSCTRL_IT_PLLRDY) ||\
                                                        ((IT) == SYSCTRL_IT_HSERDY) ||\
                                                        ((IT) == SYSCTRL_IT_HSIRDY))

/* SYSCTRL RESETFLAG  --------------------------------------------------------*/
#define SYSCTRL_RESETFLAG_POR                            bv0
#define SYSCTRL_RESETFLAG_LVD                            bv3
#define SYSCTRL_RESETFLAG_IWDT                           bv4
#define SYSCTRL_RESETFLAG_WWDT                           bv5
#define SYSCTRL_RESETFLAG_PIN                            bv6
#define SYSCTRL_RESETFLAG_LOCKUP                         bv8
#define SYSCTRL_RESETFLAG_SYSRESETREQ                    bv9
#define SYSCTRL_RESETFLAG_ALL                            (bv9|bv8|bv6|bv5|bv4|bv3|bv0)
#define IS_SYSCTRL_RSTFLAG(FLAG)                         ((FLAG) == SYSCTRL_RESETFLAG_POR || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_LVD || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_IWDT || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_WWDT || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_PIN || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_LOCKUP || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_SYSRESETREQ || \
                                                          (FLAG) == SYSCTRL_RESETFLAG_ALL)

/* SYSCTRL AHB  --------------------------------------------------------*/
#define SYSCTRL_AHB_PERIPH_CORDIC                      bv8
#define SYSCTRL_AHB_PERIPH_GPIOF                       bv7
#define SYSCTRL_AHB_PERIPH_GPIOC                       bv6
#define SYSCTRL_AHB_PERIPH_GPIOB                       bv5
#define SYSCTRL_AHB_PERIPH_GPIOA                       bv4
#define SYSCTRL_AHB_PERIPH_EAU                         bv3
#define SYSCTRL_AHB_PERIPH_CRC                         bv2
#define SYSCTRL_AHB_PERIPH_FLASH                       bv1
#define SYSCTRL_AHB_PERIPH_DMA                         bv0
#define IS_SYSCTRL_AHB_PERIPH(PERIPH)                  ((((PERIPH) & 0xFFFFFE00 ) == 0x00) && ((PERIPH) != 0x00))


