JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_sysctrl.h
/* SYSCTRL APB2  --------------------------------------------------------*/
#define SYSCTRL_APB2_PERIPH_HALLTIM                    bv12
#define SYSCTRL_APB2_PERIPH_I2C2                       bv11
#define SYSCTRL_APB2_PERIPH_DAC                        bv10
#define SYSCTRL_APB2_PERIPH_OPA                        bv9
#define SYSCTRL_APB2_PERIPH_LPTIM                      bv7
#define SYSCTRL_APB2_PERIPH_I2C1                       bv6
#define SYSCTRL_APB2_PERIPH_WWDT                       bv5
#define SYSCTRL_APB2_PERIPH_IWDT                       bv4
#define SYSCTRL_APB2_PERIPH_BTIM123                    bv2
#define SYSCTRL_APB2_PERIPH_RTC                        bv1
#define IS_SYSCTRL_APB2_PERIPH(PERIPH)                 ((((PERIPH) & 0xFFFFC109) == 0x00) && ((PERIPH) != 0x00))

#define __SYSCTRL_HALLTIM_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_HALLTIM))
#define __SYSCTRL_I2C2_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_I2C2))
#define __SYSCTRL_DAC_CLK_ENABLE()                       REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_DAC))
#define __SYSCTRL_OPA_CLK_ENABLE()                       REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_OPA))
#define __SYSCTRL_LPTIM_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_LPTIM))
#define __SYSCTRL_I2C1_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_I2C1))
#define __SYSCTRL_WWDT_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_WWDT))
#define __SYSCTRL_IWDT_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_IWDT))
#define __SYSCTRL_BTIM123_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_BTIM123))
#define __SYSCTRL_RTC_CLK_ENABLE()                       REGBITS_SET(CW_SYSCTRL->APBEN2, (SYSCTRL_KEY | SYSCTRL_APB2_PERIPH_RTC))

#define __SYSCTRL_HALLTIM_CLK_DISABLE()                (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_HALLTIM))))
#define __SYSCTRL_I2C2_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_I2C2))))
#define __SYSCTRL_DAC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_DAC))))
#define __SYSCTRL_OPA_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_OPA))))
#define __SYSCTRL_LPTIM_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_LPTIM))))
#define __SYSCTRL_I2C1_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_I2C1))))
#define __SYSCTRL_WWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_WWDT))))
#define __SYSCTRL_IWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_IWDT))))
#define __SYSCTRL_BTIM123_CLK_DISABLE()                (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_BTIM123))))
#define __SYSCTRL_RTC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 = (SYSCTRL_KEY | (CW_SYSCTRL->APBEN2 & (~SYSCTRL_APB2_PERIPH_RTC))))

/* SYSCTRL AHB RST --------------------------------------------------------*/
#define __SYSCTRL_CORDIC_RST_ENABLE()                  REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_CORDIC))
#define __SYSCTRL_GPIOF_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOF))
#define __SYSCTRL_GPIOC_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOC))
#define __SYSCTRL_GPIOB_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOB))
#define __SYSCTRL_GPIOA_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOA))
#define __SYSCTRL_EAU_RST_ENABLE()                     REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_EAU))
#define __SYSCTRL_CRC_RST_ENABLE()                     REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_CRC))
#define __SYSCTRL_FLASH_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_FLASH))
#define __SYSCTRL_DMA_RST_ENABLE()                     REGBITS_CLR(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_DMA))

#define __SYSCTRL_CORDIC_RST_DISABLE()                  REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_CORDIC))
#define __SYSCTRL_GPIOF_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOF))
#define __SYSCTRL_GPIOC_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOC))
#define __SYSCTRL_GPIOB_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOB))
#define __SYSCTRL_GPIOA_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_GPIOA))
#define __SYSCTRL_EAU_RST_DISABLE()                     REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_EAU))
#define __SYSCTRL_CRC_RST_DISABLE()                     REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_CRC))
#define __SYSCTRL_FLASH_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_FLASH))
#define __SYSCTRL_DMA_RST_DISABLE()                     REGBITS_SET(CW_SYSCTRL->AHBRST, (SYSCTRL_AHB_PERIPH_DMA))

/* SYSCTRL APB1 RST --------------------------------------------------------*/
#define __SYSCTRL_SPI3_RST_ENABLE()                    REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI3))
#define __SYSCTRL_SPI2_RST_ENABLE()                    REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI2))
#define __SYSCTRL_GTIM4_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM4))
#define __SYSCTRL_GTIM3_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM3))
#define __SYSCTRL_UART3_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART3))
#define __SYSCTRL_GTIM2_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM2))
#define __SYSCTRL_GTIM1_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM1))
#define __SYSCTRL_ATIM_RST_ENABLE()                    REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_ATIM))
#define __SYSCTRL_UART2_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART2))
#define __SYSCTRL_UART1_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART1))
#define __SYSCTRL_SPI1_RST_ENABLE()                    REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI1))
#define __SYSCTRL_VC_RST_ENABLE()                      REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_VC))
#define __SYSCTRL_ADC_RST_ENABLE()                     REGBITS_CLR(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_ADC)) 

