JWXL19733/WeGui_RGB/CW32L012/cw32l012_peripheral/inc/cw32l012_sysctrl.h
#define __SYSCTRL_SPI3_RST_DISABLE()                    REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI3))
#define __SYSCTRL_SPI2_RST_DISABLE()                    REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI2))
#define __SYSCTRL_GTIM4_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM4))
#define __SYSCTRL_GTIM3_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM3))
#define __SYSCTRL_UART3_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART3))
#define __SYSCTRL_GTIM2_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM2))
#define __SYSCTRL_GTIM1_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_GTIM1))
#define __SYSCTRL_ATIM_RST_DISABLE()                    REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_ATIM))
#define __SYSCTRL_UART2_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART2))
#define __SYSCTRL_UART1_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_UART1))
#define __SYSCTRL_SPI1_RST_DISABLE()                    REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_SPI1))
#define __SYSCTRL_VC_RST_DISABLE()                      REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_VC))
#define __SYSCTRL_ADC_RST_DISABLE()                     REGBITS_SET(CW_SYSCTRL->APBRST1, (SYSCTRL_APB1_PERIPH_ADC)) 

/* SYSCTRL APB2 RST --------------------------------------------------------*/
#define __SYSCTRL_HALLTIM_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_HALLTIM))
#define __SYSCTRL_I2C2_RST_ENABLE()                      REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_I2C2))
#define __SYSCTRL_DAC_RST_ENABLE()                       REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_DAC))
#define __SYSCTRL_OPA_RST_ENABLE()                       REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_OPA))
#define __SYSCTRL_LPTIM_RST_ENABLE()                     REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_LPTIM))
#define __SYSCTRL_I2C1_RST_ENABLE()                      REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_I2C1))
#define __SYSCTRL_WWDT_RST_ENABLE()                      REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_WWDT))
#define __SYSCTRL_IWDT_RST_ENABLE()                      REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_IWDT))
#define __SYSCTRL_BTIM123_RST_ENABLE()                   REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_BTIM123))
#define __SYSCTRL_RTC_RST_ENABLE()                       REGBITS_CLR(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_RTC))

#define __SYSCTRL_HALLTIM_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_HALLTIM))
#define __SYSCTRL_I2C2_RST_DISABLE()                      REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_I2C2))
#define __SYSCTRL_DAC_RST_DISABLE()                       REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_DAC))
#define __SYSCTRL_OPA_RST_DISABLE()                       REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_OPA))
#define __SYSCTRL_LPTIM_RST_DISABLE()                     REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_LPTIM))
#define __SYSCTRL_I2C1_RST_DISABLE()                      REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_I2C1))
#define __SYSCTRL_WWDT_RST_DISABLE()                      REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_WWDT))
#define __SYSCTRL_IWDT_RST_DISABLE()                      REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_IWDT))
#define __SYSCTRL_BTIM123_RST_DISABLE()                   REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_BTIM123))
#define __SYSCTRL_RTC_RST_DISABLE()                       REGBITS_SET(CW_SYSCTRL->APBRST2, (SYSCTRL_APB2_PERIPH_RTC))




#define SYSCTRL_MCO_DIV1                                (0x00U)
#define SYSCTRL_MCO_DIV2                                ((uint8_t)(0x01U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV4                                ((uint8_t)(0x02U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV8                                ((uint8_t)(0x03U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV16                               ((uint8_t)(0x04U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV32                               ((uint8_t)(0x05U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV64                               ((uint8_t)(0x06U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV128                              ((uint8_t)(0x07U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV256                              ((uint8_t)(0x08U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV512                              ((uint8_t)(0x09U << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV1024                             ((uint8_t)(0x0AU << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV2048                             ((uint8_t)(0x0BU << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV4096                             ((uint8_t)(0x0CU << SYSCTRL_MCO_DIV_Pos))
#define SYSCTRL_MCO_DIV8192                             ((uint8_t)(0x0DU << SYSCTRL_MCO_DIV_Pos))
#define IS_SYSCTRL_MCO_DIV(INSTANCE)                   ((INSTANCE) <= 0x0DU)

#define SYSCTRL_MCO_SRC_NONE                           (0x00U)
#define SYSCTRL_MCO_SRC_HCLK                           (0x01U)
#define SYSCTRL_MCO_SRC_PCLK                           (0x02U)
#define SYSCTRL_MCO_SRC_HSI                            (0x03U)
#define SYSCTRL_MCO_SRC_LSI                            (0x04U)
#define SYSCTRL_MCO_SRC_HSE                            (0x05U)
#define SYSCTRL_MCO_SRC_LSE                            (0x06U)
#define SYSCTRL_MCO_SRC_PLL                            (0x07U)
#define SYSCTRL_MCO_SRC_RC8K                           (0x09U)

#define IS_SYSCTRL_MCO_SRC(INSTANCE)                   (((INSTANCE) == SYSCTRL_MCO_SRC_NONE)       || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_HCLK)        || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_PCLK)        || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_HSI)         || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_LSI)         || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_HSE)         || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_LSE)         || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_PLL)         || \
                                                       ((INSTANCE) == SYSCTRL_MCO_SRC_RC8K))

// #define RCC_HSE_FLT_CLOSE                       (0x00000000U)
// #define RCC_HSE_FLT_OPEN                        (0x01000000U)
//==================================================================================
extern void SYSCTRL_HCLKPRS_Config(uint32_t HCLKPRS);
extern void SYSCTRL_PCLKPRS_Config(uint32_t PCLKPRS);
extern void SYSCTRL_SYSCLKSRC_Config(uint32_t SYSCLKSRC);
extern void SYSCTRL_CCS_Config(uint32_t CCS, FunctionalState NewState);
extern void SYSCTRL_LSELOCK_Config(uint32_t LSELOCK);
extern void SYSCTRL_WAKEUPCLK_Config(uint32_t WAKEUPCLK);
extern void SYSCTRL_LOCKUP_Config(uint32_t LOCKUP);
extern void SYSCTRL_SWDIO_Config(uint32_t SWDIO);
extern void SYSCTRL_BrakeConfig(uint32_t BrakeType, FunctionalState NewState);
extern int SYSCTRL_DeInit(void);
extern void SYSCTRL_SystemCoreClockUpdate(uint32_t NewFreq);
extern int SYSCTRL_HSI_Enable(uint32_t HSIDiv);
extern void SYSCTRL_HSI_Disable(void);
extern int SYSCTRL_LSI_Enable(void);
extern void SYSCTRL_LSI_Disable(void);
extern void SYSCTRL_HSEWaitClockSet(uint32_t WaitClock);
extern void SYSCTRL_HSEEnablePinPolSet(uint32_t Polarity);
int SYSCTRL_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt);
void SYSCTRL_HSE_Disable(void);
extern int SYSCTRL_LSE_Enable(uint32_t Mode, uint8_t Driver);
extern void SYSCTRL_LSE_Disable(void);
extern int SYSCTRL_PLL_Enable(PLL_InitTypeDef *PLL_InitStruct);
void SYSCTRL_PLL_Disable(void);
extern int SYSCTRL_SysClk_Switch(uint32_t NewClk);
extern void SYSCTRL_ITConfig(uint32_t SYSCTRL_IT, FunctionalState NewState);
extern ITStatus SYSCTRL_GetITStatus(uint32_t SYSCTRL_IT);
extern void SYSCTRL_ClearITPendingBit(uint32_t SYSCTRL_IT);
extern FlagStatus SYSCTRL_GetStableFlag(uint32_t SYSCTRL_STABLEFLAG);
extern uint32_t SYSCTRL_GetAllStableFlag(void);
extern void SYSCTRL_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState);
extern void SYSCTRL_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState);
extern void SYSCTRL_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState);
extern void SYSCTRL_AHBPeriphReset(uint32_t Periph, FunctionalState NewState);
extern void SYSCTRL_APBPeriphReset1(uint32_t Periph, FunctionalState NewState);
extern void SYSCTRL_APBPeriphReset2(uint32_t Periph, FunctionalState NewState);
extern FlagStatus SYSCTRL_GetRstFlag(uint32_t SYSCTRL_RSTFLAG);
extern uint32_t SYSCTRL_GetAllRstFlag(void);
extern void SYSCTRL_ClearRstFlag(uint32_t SYSCTRL_RSTFLAG);

extern void SYSCTRL_PCLK_OUT(void);
extern void SYSCTRL_MCO_OUT(uint8_t Source, uint8_t Div);

extern uint32_t SYSCTRL_GetHClkFreq(void);
extern uint32_t SYSCTRL_GetPClkFreq(void);

void SYSCTRL_GotoSleep(void);
void SYSCTRL_GotoDeepSleep(void);
void SYSCTRL_ConfigSleepOnExit(FunctionalState state);

#ifdef __cplusplus
}
#endif

#endif /* __CW32L012_SYSCTRL_H */
